import {
  MatchType1,
  MatchType2,
  MatchType3,
  MatchType4,
  MatchType5,
  MatchType6,
  MatchType7,
  MatchType8,
  MatchType9,
  MatchType10,
} from "@/config";

export default function MatchRule({ matchType }) {
  const contents = [
    " ",
    // 1 --- BR Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎮RUSH ARENA || BR MATCH RULES
      </p>

      <p className="text-yellow-400 mt-3">
        1. ম্যাচে জয়েন করার সময় অবশ্যই আপনার গেম আইডি ভালোভাবে মিলিয়ে নেবেন। গেম
        আইডি ব্যতীত অন্য কিছু লিখে জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        ⚠️অ্যাপের মধ্যে আপনি যত নাম্বারে জয়েন হবেন গেমের মধ্যেও ঠিক একই নাম্বার
        স্লটে আপনাকে থাকতে হবে। অন্যথায় কিক দেওয়া হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে ৪০ হতে হবে। এর কম
        লেভেলের হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-300 mt-3">
        ⛔কোনো Female Character ব্যাবহার করা যাবেনা। এখন সবার Gameplay Fair হবে।
        ধন্যবাদ
      </p>

      <p className="text-yellow-400 mt-3">
        3. ম্যাচ শুরুর নির্ধারিত সময়ের মধ্যেই আপনাকে ম্যাচে জয়েন করতে হবে। সময়
        পার হয়ে গেলে জয়েন করতে না পারলে তার দায় Rush Arena নেবে না, এবং কোনো
        রিফান্ড দেওয়া হবে না, কারণ আপনার জন্য যথাযথ সময় পর্যন্ত অপেক্ষা করা
        হয়েছে।
      </p>

      <p className="text-blue-400 mt-3">
        4. আপনি ম্যাচে জয়েন করার পর যদি দেখেন ৪৮ স্লট পূর্ণ অথবা আপনাকে ম্যাচ
        থেকে কিক করে দেওয়া হয়েছে সেক্ষেত্রে অবশ্যই একটি ভিডিও ধারণ করবেন।
        ভিডিওতে অবশ্যই সময় দেখা যাবে, এবং আমরা সেই সময় ম্যাচের সময়ের সঙ্গে
        মিলিয়ে দেখব। যদি ভিডিওটির সময় ম্যাচের সময়ের পর হয়, তাহলে ভিডিওটি
        গ্রহণযোগ্য হবে না।
      </p>

      <p className="text-red-400 mt-3">
        5. আপনি যদি আপনার জয়েন করা ম্যাচের রুম আইডি ও পাসওয়ার্ড অন্য কাউকে শেয়ার
        করেন এবং ধরা পড়েন, তাহলে আপনাকে অ্যাপ থেকে স্থায়ীভাবে ব্যান করা হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        6. ম্যাচ শুরু হওয়ার পর কোনো কারণে আপনি যদি ম্যাচে প্রবেশ করতে না পারেন,
        তাহলে তার জন্য Rush Arena দায়ী থাকবে না, কারণ এটি সাধারণত আপনার
        নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-red-400 mt-3">
        7. আপনি যদি নিজের জয়েন করা ম্যাচে বাইরের প্লেয়ার ঢুকিয়ে নিজেই কিল করেন,
        তাহলে আপনাকে অ্যাপ থেকে স্থায়ীভাবে ব্যান করা হবে।
      </p>

      <p className="text-red-400 mt-3">
        ৪. ❌কোনো প্রকার স্নাইপার, ডাবল ভেক্টর ইউজ করা যাবে না। করলে রিওয়ার্ড
        দেয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        9. 🚗ম্যাচের মধ্যে কোনো ধরনের গাড়ি চালানো যাবে না। চালালে রিওয়ার্ড দেওয়া
        হবেনা।
      </p>

      <p className="text-yellow-400 mt-3">
        10. BR ম্যাচে কোনো প্লেয়ার যদি ৭টির বেশি কিল করে, তাহলে তাকে শুধু ৭
        কিলের টাকা দেওয়া হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        11. ম্যাচের মধ্যে কোনো ধরনের গাড়ি ব্যবহার করা যাবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        তবে আপনি যদি এমন কোনো কঠিন জোনে আটকে যান, যেখান থেকে দৌড়ে বের হওয়া
        অসম্ভব,
      </p>

      <p className="text-yellow-400 mt-3">
        তাহলে সেখানে গাড়ি ব্যবহার করা যাবে -
      </p>

      <p className="text-yellow-400 mt-3">
        কিন্তু জোনে ঢোকার আগেই গাড়ি থেকে নেমে যেতে হবে।
      </p>

      <p className="text-blue-400 mt-3">
        12. ম্যাচ চলাকালে কেউ যদি আমাদের উল্লেখিত রুলস ভঙ্গ করে আপনাকে কিল করে,
        তাহলে আপনি ইন-গেম থেকে বা রেকর্ডার চালু থাকলে সেই ভিডিওটি সাপোর্টে
        পাঠাবেন।
      </p>

      <p className="text-blue-400 mt-3">আপনার সমস্যার সমাধান করা হবে।</p>

      <p className="text-red-400 mt-3">
        13. ম্যাচের মধ্যে কেউ টিম আপ করলে, তাকে Rush Arena থেকে ব্যান করে দেওয়া
        হবে।
      </p>

      <p className="text-red-400 mt-3">
        14. ম্যাচের মধ্যে কেউ যদি হ্যাক বা অস্বাভাবিক কিছু ব্যবহার করে ধরা পড়ে,
        তাহলে তার অ্যাকাউন্টের সব ব্যালেন্সসহ অ্যাকাউন্টটি ব্যান করা হবে।
      </p>

      <p className="text-red-400 mt-3">
        ❌তাও চিরতরের জন্য ডিভাইস ব্যান্ড করে দেওয়া হবে।
      </p>

      <p className="text-green-400 mt-3">
        👮‍♂️যদি কোন প্লেয়ার হ্যাক বা টিমিং করেছে এরকম প্রমাণ দিতে পারেন তাহলে Rush
        Arena এর পক্ষ থেকে আপনাকে রিওয়ার্ড দেয়া হবে।
      </p>

      <p className="text-green-400 mt-3">
        15. একটি ম্যাচ শেষ হওয়ার ১০-২০ মিনিটের মধ্যে আপনার রিওয়ার্ড আপনার
        অ্যাকাউন্টে অ্যাড হয়ে যাবে।
      </p>

      <p className="text-yellow-400 mt-3">
        16. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        "ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 2 --- Survival Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎮RUSH ARENA || SURVIVAL MATCH RULES :-
      </p>

      <p className="text-yellow-400 mt-3">
        1. ম্যাচে জয়েন করার সময় অবশ্যই আপনার গেম আইডি ভালোভাবে মিলিয়ে নেবেন।
      </p>

      <p className="text-yellow-400 mt-3">
        ⚠️গেম আইডি ব্যতীত অন্য কিছু লিখে জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        ⚠️অ্যাপের মধ্যে আপনি যত নাম্বারে জয়েন হবেন গেমের মধ্যেও ঠিক একই নাম্বার
        স্লটে আপনাকে থাকতে হবে। অন্যথায় কিক দেওয়া হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে ৪০ লেভেল হতে হবে।
        এর কম লেভেলের হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-300 mt-3">
        ⛔কোনো Female Character ব্যাবহার করা যাবেনা। এখন সবার Gameplay Fair হবে।
        ধন্যবাদ
      </p>

      <p className="text-yellow-400 mt-3">
        3. ম্যাচ শুরুর নির্ধারিত সময়ের মধ্যেই আপনাকে ম্যাচে জয়েন করতে হবে। সময়
        পার হয়ে গেলে জয়েন করতে না পারলে তার দায় Rush Arena নেবে না, এবং কোনো
        রিফান্ড দেওয়া হবে না, কারণ আপনার জন্য যথাযথ সময় পর্যন্ত অপেক্ষা করা
        হয়েছে।
      </p>

      <p className="text-blue-400 mt-3">
        4. আপনি ম্যাচে জয়েন করার পর যদি দেখেন ৪৮ স্লট পূর্ণ অথবা আপনাকে ম্যাচ
        থেকে কিক করে দেওয়া হয়েছে সেক্ষেত্রে অবশ্যই একটি ভিডিও ধারণ করবেন।
        ভিডিওতে অবশ্যই সময় দেখা যাবে, এবং আমরা সেই সময় ম্যাচের সময়ের সঙ্গে
        মিলিয়ে দেখব। যদি ভিডিওটির সময় ম্যাচের সময়ের পর হয়, তাহলে ভিডিওটি
        গ্রহণযোগ্য হবে না।
      </p>

      <p className="text-red-400 mt-3">
        5. আপনি যদি আপনার জয়েন করা ম্যাচের রুম আইডি ও পাসওয়ার্ড অন্য কাউকে শেয়ার
        করেন এবং ধরা পড়েন, তাহলে আপনাকে অ্যাপ থেকে স্থায়ীভাবে ব্যান করা হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        6. ম্যাচ শুরু হওয়ার পর কোনো কারণে আপনি যদি ম্যাচে প্রবেশ করতে না পারেন,
        তাহলে তার জন্য Rush Arena দায়ী থাকবে না, কারণ এটি সাধারণত আপনার
        নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-red-400 mt-3">
        7. আপনি যদি নিজের জয়েন করা ম্যাচে বাইরের প্লেয়ার ঢুকিয়ে নিজেই কিল করেন,
        তাহলে আপনাকে অ্যাপ থেকে স্থায়ীভাবে ব্যান করা হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        8. BR ম্যাচে কোনো প্লেয়ার যদি ৭টির বেশি কিল করে, তাহলে তাকে শুধু ৭ কিলের
        টাকা দেওয়া হবে।
      </p>

      <p className="text-red-400 mt-3">
        9. ম্যাচের মধ্যে কেউ টিম আপ করলে, তাকে Rush Arena থেকে ব্যান করে দেওয়া
        হবে।
      </p>

      <p className="text-red-400 mt-3">
        10.. ম্যাচের মধ্যে কোনো ধরনের Sniper বন্দুক ব্যবহার করা যাবে না।
      </p>

      <p className="text-red-400 mt-3">
        11. ম্যাচের মধ্যে কেউ যদি হ্যাক বা অস্বাভাবিক কিছু ব্যবহার করে ধরা পড়ে,
        তাহলে তার অ্যাকাউন্টের সব ব্যালেন্সসহ অ্যাকাউন্টটি ব্যান করা হবে। তাও
        চিরতরের জন্য ডিভাইস ব্যান্ড করা হবে।☠️
      </p>

      <p className="text-green-400 mt-3">
        🤦‍♂️যদি কোন প্লেয়ার হ্যাক বা টিমিং করেছে এরকম প্রমাণ দিতে পারেন তাহলে Rush
        Arena এর পক্ষ থেকে আপনাকে রিওয়ার্ড দেয়া হবে।
      </p>

      <p className="text-yellow-400 mt-3">12.</p>

      <p className="text-green-400 mt-3">🔰 Vehicles Allow✅</p>

      <p className="text-green-400 mt-3">🔰 All Gun Allow✅</p>

      <p className="text-green-400 mt-3">🔰 Zone Damage High✅</p>

      <p className="text-green-400 mt-3">
        13. একটি ম্যাচ শেষ হওয়ার ১০-২০ মিনিটের মধ্যে আপনার রিওয়ার্ড আপনার
        অ্যাকাউন্টে অ্যাড হয়ে যাবে।
      </p>

      <p className="text-yellow-400 mt-3">
        14. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅"ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 3 --- Squad BR Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎮RUSH ARENA || BR Squad MATCH RULES
      </p>
      <p className="text-yellow-400 mt-3">
        ⚠️ অ্যাপের মধ্যে আপনি যত নাম্বারে জয়েন হবেন গেমের মধ্যেও ঠিক একই নাম্বার
        স্লটে আপনাকে থাকতে হবে। অন্যথায় কিক দেওয়া হবে।
      </p>

      <p className="text-red-400 mt-3">
        📸 ম্যাচের মধ্যে কমপক্ষে ৩টা থেকে ৪টা স্ক্রিনশট নিবেন আলাদা আলাদা সময়ের।
        প্রয়োজনবশত স্ক্রিনশটগুলো চাওয়া হতে পারে। Screenshot না দিলে রিওয়ার্ড
        দেওয়া হবে না।
      </p>

      <p className="text-yellow-300 mt-3">
        🚫 কোনো Female Character ব্যাবহার করা যাবেনা। এখন সবার Gameplay Fair
        হবে। – ধন্যবাদ
      </p>

      <p className="text-blue-400 mt-3">
        🎥 Room ID এবং Password Collect থেকে শুরু করে প্লেন পর্যন্ত Video Screen
        Record করে রাখতে হবে।
      </p>

      <p className="text-green-400 mt-3">
        🕵️ যদি কোন প্লেয়ার হ্যাক বা টিমিং করেছে এরকম প্রমাণ দিতে পারেন তাহলে
        Rush Arena এর পক্ষ থেকে আপনাকে রিওয়ার্ড দেয়া হবে।
      </p>

      <p className="text-red-400 mt-3">
        ❌ কোনো প্রকার স্নাইপার, ডাবল ভেক্টর ও M590 ইউজ করা যাবে না। করলে
        রিওয়ার্ড দেয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        🚗 কোনো ধরনের গাড়ি চালানো যাবে না। চালালে রিওয়ার্ড দেওয়া হবেনা।
      </p>

      <p className="text-yellow-400 mt-3">
        🔫 BR ম্যাচে কেউ ৭ কিলের অধিক কিল করলে তাকে ৭ কিলের টাকাই দেওয়া হবে।
      </p>

      <p className="text-red-400 mt-3">
        🚷 আপনার ফ্রি ফায়ার আইডি লেভেল ৪০ এর নিচে হলে রুম থেকে কিক দেয়া হবে এবং
        কোনো রকম রিফান্ড দেয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        🔒 রুম আইডি এবং পাসওয়ার্ড Unregistered কারো সাথে শেয়ার করবেন না।
      </p>

      <p className="text-red-400 mt-3">
        🧨 কেও যদি হ্যাক বা টিমিং করার সময় ধরা পরে তাকে অ্যাপ থেকে ব্যান করে
        দেয়া হবে এবং Full Map এ Heal Battle করলে কোন রিওয়ার্ড পাবেন না।
      </p>

      <p className="text-yellow-400 mt-3">
        👥 Duo এবং Squad এ আপনার টিমমেট না থাকলে রুমে গিয়ে Random প্লেয়ার এর
        সাথে খেলতে হবে। রুমের মধ্যে অন্য টিমকে বিরক্ত করলে সাথে সাথে রুম থেকে
        বের করে দেয়া হবে এবং আপনার টাকা ফেরত দেয়া হবে না।
      </p>

      <p className="text-blue-400 mt-3">
        🕐 রুম আইডি এবং পাসওয়ার্ড ম্যাচ টাইমের ০৫ থেকে ০৭ মিনিট আগে দেয়া হবে।
        আপনি যদি না জানেন কিভাবে রুমে জয়েন করতে হয় তাহলে আমাদের অ্যাপ থেকে ভিডিও
        দেখে নিতে পারেন।
      </p>

      <p className="text-yellow-400 mt-3">
        💬 যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅ “ADMIN” এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 4 --- Clash Squad Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎮RUSH ARENA || CLASH SQUAD MATCH RULES:-
      </p>

      <p className="text-yellow-400 mt-3">
        1. 🎯Solo Match এর নিয়ম: (1, 3, 5, 7 হলে আপনি থাকবেন টিম ১। যদি অ্যাপে
        জয়েন দেন 2, 4, 6, 8 এতে আপনি থাকবেন টিম ২)। কাস্টমে রুমে গিয়ে সেই টিমে
        বসবেন। না হলে কিক খেলে টাকা ফেরত পাবেন না।
      </p>

      <p className="text-yellow-400 mt-3">
        ম্যাচে যোগ দেওয়ার সময় অবশ্যই আপনার গেম আইডি সঠিকভাবে মিলিয়ে নিবেন। গেম
        আইডি ছাড়া বা অন্য কিছু লিখে জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে ৪০ হতে হবে। এর কম
        হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        3. CLASH SQUAD ম্যাচ কেও যদি ম্যাচে জয়েন করতে না পারে, তাহলে তাকে কোন
        প্রোকার টাকা রিফান্ড দেওয়া হবে।
      </p>

      <p className="text-red-400 mt-3">
        🚫ইমোট দেওয়া যাবে না, দিলে Winning এড হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        4. ম্যাচ শুরু হওয়ার পরে যদি কোনো কারণে আপনি ম্যাচে প্রবেশ করতে না পারেন,
        তাহলে এর জন্য Rush Arena বা প্রতিপক্ষ টিম দায়ী থাকবে না, কারণ এটি আপনার
        নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-yellow-300 mt-3">
        🚫কোনো Female Character ব্যাবহার করা যাবেনা। এখন সবার Gameplay Fair হবে।
        ধন্যবাদ
      </p>

      <p className="text-yellow-400 mt-3">
        5. ম্যাচ শুরু হওয়ার পর যদি কোনো এক পাশের টিমের একজন প্লেয়ার ম্যাচে
        প্রবেশ করতে না পারে, তাহলে প্রতিপক্ষ টিমের একজন ব্যাক দিবে বা জুনে
        এলিমিনেটেড হবে। তার টিম হারলে সে রিফান্ড পাবে, আর জিতলে উইনিং পাবে। যদি
        প্রতিপক্ষ টিম থেকে কেউ ব্যাক বা এলিমিনেটেড না হয়, তাহলে তাদের টিমকে কোনো
        প্রকার রিওয়ার্ড বা রিফান্ড দেওয়া হবে না। এবং যে প্লেয়ার ম্যাচে ঢুকতে
        পারেনি তাকেও কোনো রিফান্ড দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        6. ম্যাচ চলাকালীন কেউ যদি টিমিং করে বা ইচ্ছাকৃতভাবে
      </p>

      <p className="text-red-400 mt-3">Join the Battle</p>

      <p className="text-red-400 mt-3">
        প্রতিপক্ষকে জিতিয়ে দেয়, তাহলে তার এন্ট্রি ফি সহ অতিরিক্ত ৫০ টাকা জরিমানা
        করা হবে।
      </p>

      <p className="text-red-400 mt-3">
        7. ম্যাচে কোনো প্রকার ফ্লাস গ্রেনেড বা বোম জাতীয় আইটেম ব্যবহার করা যাবে
        না।
      </p>

      <p className="text-red-400 mt-3">
        ভুলবশত ব্যবহার করলেও কোনো রিওয়ার্ড বা রিফান্ড দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        8. ⛔যদি হ্যাক ইউজ করার সময় ধরা পরে তাহলে "Rush Arena" থেকে ব্যান করে
        দেওয়া হবে। তাও চিরতরের জন্য ডিভাইস ব্যান্ড করা হবে।☠️
      </p>

      <p className="text-yellow-400 mt-3">
        9. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅"ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 5 --- CS 2 vs 2 Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        RUSH ARENA || CS 2 vs 2 Match Rules:-
      </p>

      <p className="text-yellow-400 mt-3">
        1. 🎯Solo Match এর নিয়ম: (1, 3 হলে আপনি থাকবেন টিম ১। যদি অ্যাপে জয়েন
        দেন 2, 4 এতে আপনি থাকবেন টিম ২)। কাস্টমে রুমে গিয়ে সেই টিমে বসবেন। না
        হলে কিক খেলে টাকা ফেরত পাবেন না।
      </p>

      <p className="text-yellow-400 mt-3">
        ম্যাচে যোগ দেওয়ার সময় অবশ্যই আপনার গেম আইডি সঠিকভাবে মিলিয়ে নিবেন। গেম
        আইডি ছাড়া বা অন্য কিছু লিখে জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        🚫ইমোট দেওয়া যাবে না, দিলে Winning এড হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে ৪০ হতে হবে। এর কম
        হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        3. আপনি যদি ম্যাচে জয়েন করতে না পারেন, তাহলে রিফান্ড দেওয়া হবে না ।
      </p>

      <p className="text-yellow-400 mt-3">
        4. ম্যাচ শুরু হওয়ার পরে যদি কোনো কারণে আপনি ম্যাচে প্রবেশ করতে না পারেন,
        তাহলে এর জন্য Rush Arena বা প্রতিপক্ষ টিম দায়ী থাকবে না, কারণ এটি আপনার
        নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-yellow-400 mt-3">
        5. ম্যাচ শুরু হওয়ার পর যদি কোনো এক পাশের টিমের একজন প্লেয়ার ম্যাচে
        প্রবেশ করতে না পারে, তাহলে প্রতিপক্ষ টিমের একজন ব্যাক দিবে বা জুনে
        এলিমিনেটেড হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        তার টিম হারলে সে রিফান্ড পাবে, আর জিতলে উইনিং পাবে।
      </p>

      <p className="text-yellow-400 mt-3">
        যদি প্রতিপক্ষ টিম থেকে কেউ ব্যাক বা এলিমিনেটেড না হয়, তাহলে তাদের টিমকে
        কোনো প্রকার রিওয়ার্ড বা রিফান্ড দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        এবং যে প্লেয়ার ম্যাচে ঢুকতে পারেনি তাকেও কোনো রিফান্ড দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        6. ম্যাচ চলাকালীন কেউ যদি টিমিং করে বা ইচ্ছাকৃতভাবে প্রতিপক্ষকে জিতিয়ে
        দেয়, তাহলে তার এন্ট্রি ফি সহ অতিরিক্ত ৫০ টাকা জরিমানা করা হবে।
      </p>

      <p className="text-red-400 mt-3">
        7. ম্যাচে কোনো প্রকার ফ্লাস গ্রেনেড বা বোম জাতীয় আইটেম ব্যবহার করা যাবে
        না। ভুলবশত ব্যবহার করলেও কোনো রিওয়ার্ড বা রিফান্ড দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        8. 👥 কোনো ম্যাচে ৭ জন প্লেয়ার হলে এক্ষেত্রে "3v3" করানো হবে এবং ১ জনকে
        রিফান্ড দেওয়া হবে।
      </p>

      <p className="text-red-400 mt-3">
        9. ⛔যদি হ্যাক ইউজ করার সময় ধরা পরে তাহলে "Rush Arena" থেকে ব্যান করে
        দেওয়া হবে। তাও চিরতরের জন্য ডিভাইস ব্যান্ড করা হবে।☠️
      </p>

      <p className="text-yellow-400 mt-3">
        10. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅"ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 6 --- CS Headshot Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        RUSH ARENA || CS Headshot Match Rules:-
      </p>

      <p className="text-yellow-400 mt-3">
        1. ম্যাচে যোগ দেওয়ার সময় অবশ্যই আপনার গেম আইডি সঠিকভাবে মিলিয়ে নিবেন।
        গেম আইডি ছাড়া বা অন্য কিছু লিখে জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে ৪০ হতে হবে। এর কম
        হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        3. ম্যাচ শুরু হওয়ার পরে যদি কোনো কারণে আপনি ম্যাচে প্রবেশ করতে না পারেন,
        তাহলে এর জন্য Rush Arena বা প্রতিপক্ষ টিম দায়ী থাকবে না, কারণ এটি আপনার
        নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-yellow-400 mt-3">
        4. ম্যাচ শুরু হওয়ার পর যদি কোনো এক পাশের টিমের একজন প্লেয়ার ম্যাচে
        প্রবেশ করতে না পারে, তাহলে প্রতিপক্ষ টিমের একজন ব্যাক দিবে। তার টিম
        হারলে সে রিফান্ড পাবে, আর জিতলে উইনিং পাবে। যদি প্রতিপক্ষ টিম থেকে কেউ
        ব্যাক না দেওয়া হয়, তাহলে তাদের টিমকে কোনো প্রকার রিওয়ার্ড বা রিফান্ড
        দেওয়া হবে না। এবং যে প্লেয়ার ম্যাচে ঢুকতে পারেনি তাকেও কোনো রিফান্ড
        দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        5. ম্যাচ চলাকালীন কেউ যদি টিমিং করে বা ইচ্ছাকৃতভাবে প্রতিপক্ষকে জিতিয়ে
        দেয়, তাহলে তার এন্ট্রি ফি সহ অতিরিক্ত ৫০ টাকা জরিমানা করা হবে।
      </p>

      <p className="text-red-400 mt-3">
        🚫ইমোট দেওয়া যাবে না, দিলে Winning এড হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        6. ম্যাচের লাস্টে ZOON PACK করে যদি কোন প্লেয়ার রাউন্ড বের করে এবং সে
        প্লেয়ার য়ের টিম যদি ম্যাচ Win করে তাহলে সে প্লেয়ার বাদে ম্যাচের সবাইকে
        রিফান্ড করে দেওয়া হবে।
      </p>

      <p className="text-red-400 mt-3">
        7. ⛔যদি হ্যাক ইউজ করার সময় ধরা পরে তাহলে "Rush Arena" থেকে ব্যান করে
        দেওয়া হবে। তাও চিরতরের জন্য ডিভাইস ব্যান্ড করা হবে।☠️
      </p>

      <p className="text-yellow-400 mt-3">
        8. [1,3,5,7 vs 2,4,6,8] এই রুল্স প্লেয়ার সাজানো হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        9. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅"ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 7 --- Lone Wolf Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎮RUSH ARENA || King Lone Wolf Match Rules:-
      </p>

      <p className="text-yellow-400 mt-3">
        1. 🎯Solo Match এর নিয়ম: (1, 3 হলে আপনি থাকবেন টিম ১। যদি অ্যাপে জয়েন
        দেন 2, 4 এতে আপনি থাকবেন টিম ২)। কাস্টমে রুমে গিয়ে সেই টিমে বসবেন। না
        হলে কিক খেলে টাকা ফেরত পাবেন না।
      </p>

      <p className="text-yellow-400 mt-3">
        ম্যাচে যোগ দেওয়ার সময় অবশ্যই আপনার গেম আইডি সঠিকভাবে মিলিয়ে নিবেন। গেম
        আইডি ছাড়া বা অন্য কিছু লিখে জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে ৪০ হতে হবে। এর কম
        হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        ❌ইমোট দেওয়া যাবে না, দিলে Winning এড হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        3. আপনি যদি ম্যাচে জয়েন করতে না পারেন, তাহলে আপনার কোনো ধেনের রিফান্ড
        দেওয়া হবে না। তবে আপনি যদি একবার রুমে জয়েন করার পর বের হয়ে যান বা নেট
        সমস্যা হয়, তাহলে কোনো প্রকার রিফান্ড দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        4. ম্যাচ শুরু হওয়ার পরে যদি কোনো কারণে আপনি ম্যাচে প্রবেশ করতে না পারেন,
        তাহলে এর জন্য Rush Arena বা প্রতিপক্ষ টিম দায়ী থাকবে না, কারণ এটি আপনার
        নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-yellow-400 mt-3">
        5. ম্যাচ শুরু হওয়ার পর যদি কোনো এক পাশের টিমের একজন প্লেয়ার ম্যাচে
        প্রবেশ করতে না পারে, তাহলে প্রতিপক্ষ টিমের একজন ব্যাক দিবে। তার টিম
        হারলে সে রিফান্ড পাবে, আর জিতলে উইনিং পাবে। যদি প্রতিপক্ষ টিম থেকে কেউ
        ব্যাক না দেওয়া হয়, তাহলে তাদের টিমকে কোনো প্রকার রিওয়ার্ড বা রিফান্ড
        দেওয়া হবে না। এবং যে প্লেয়ার ম্যাচে ঢুকতে পারেনি তাকেও কোনো রিফান্ড
        দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        6. ম্যাচ চলাকালীন কেউ যদি টিমিং করে বা ইচ্ছাকৃতভাবে প্রতিপক্ষকে জিতিয়ে
        দেয়, তাহলে তার এন্ট্রি ফি সহ অতিরিক্ত ৫০ টাকা জরিমানা করা হবে।
      </p>

      <p className="text-green-400 mt-3">
        7. 💣LOAN WOLF যেহেতু Limited Ammo তে খেলানো হবে, সেহেতু সবকিছু ALLOW -
        গ্রেনেডও ব্যবহার করতে পারবেন।
      </p>

      <p className="text-red-400 mt-3">
        8. ⛔যদি হ্যাক ইউজ করার সময় ধরা পরে তাহলে "Rush Arena" থেকে ব্যান করে
        দেওয়া হবে। তাও চিরতরের জন্য ডিভাইস ব্যান্ড করা হবে।☠️
      </p>

      <p className="text-yellow-400 mt-3">
        9. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅"ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 8 --- Lost To Win Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎮RUSH ARENA || Lone Wolf Headshot Match Rules:-
      </p>

      <p className="text-yellow-400 mt-3">
        1. ম্যাচে যোগ দেওয়ার সময় অবশ্যই আপনার গেম আইডি সঠিকভাবে মিলিয়ে নিবেন।
        গেম আইডি ছাড়া বা অন্য কিছু লিখে জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে ৪০ হতে হবে। এর কম
        হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        3. ম্যাচ শুরু হওয়ার পরে যদি কোনো কারণে আপনি ম্যাচে প্রবেশ করতে না পারেন,
        তাহলে এর জন্য Rush Arena বা প্রতিপক্ষ টিম দায়ী থাকবে না, কারণ এটি আপনার
        নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-yellow-400 mt-3">
        4. ম্যাচ শুরু হওয়ার পর যদি কোনো এক পাশের টিমের একজন প্লেয়ার ম্যাচে
        প্রবেশ করতে না পারে, তাহলে প্রতিপক্ষ টিমের একজন ব্যাক দিবে। তার টিম
        হারলে সে রিফান্ড পাবে, আর জিতলে উইনিং পাবে। যদি প্রতিপক্ষ টিম থেকে কেউ
        ব্যাক না দেওয়া হয়, তাহলে তাদের টিমকে কোনো প্রকার রিওয়ার্ড বা রিফান্ড
        দেওয়া হবে না। এবং যে প্লেয়ার ম্যাচে ঢুকতে পারেনি তাকেও কোনো রিফান্ড
        দেওয়া হবে না।
      </p>

      <p className="text-red-400 mt-3">
        5. ম্যাচ চলাকালীন কেউ যদি টিমিং করে বা ইচ্ছাকৃতভাবে প্রতিপক্ষকে জিতিয়ে
        দেয়, তাহলে তার এন্ট্রি ফি সহ অতিরিক্ত ৫০ টাকা জরিমানা করা হবে।
      </p>

      <p className="text-red-400 mt-3">
        🚫ইমোট দেওয়া যাবে না, দিলে Winning এড হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        6. ম্যাচের লাস্টে ZOON PACK করে যদি কোন প্লেয়ার রাউন্ড বের করে এবং সে
        প্লেয়ার য়ের টিম যদি ম্যাচ Win করে তাহলে সে প্লেয়ার বাদে ম্যাচের সবাইকে
        রিফান্ড করে দেওয়া হবে।
      </p>

      <p className="text-red-400 mt-3">
        7. ⛔যদি হ্যাক ইউজ করার সময় ধরা পরে তাহলে "Rush Arena" থেকে ব্যান করে
        দেওয়া হবে। তাও চিরতরের জন্য ডিভাইস ব্যান্ড করা হবে।☠️
      </p>

      <p className="text-yellow-400 mt-3">
        8. [1,3,5,7 vs 2,4,6,8] এই রুল্স প্লেয়ার সাজানো হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        9. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅"ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 9 --- Lost To Win Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎮RUSH ARENA || Lost To Win Match Rules:-
      </p>

      <p className="text-yellow-400 mt-3">
        1. ম্যাচে যোগ দেওয়ার সময় অবশ্যই আপনার গেম আইডি সঠিকভাবে মিলিয়ে নিবেন।
        গেম আইডি ছাড়া বা অন্য কিছু লিখে জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে ৪০ হতে হবে। এর কম
        হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        3. আপনি যদি ম্যাচে জয়েন করতে না পারেন, তাহলে আপনার কোনো টাকা রিফান্ড
        দেওয়া হবে। তবে আপনি যদি একবার রুমে জয়েন করার পর বের হয়ে যান বা নেট
        সমস্যা হয়, তাহলে কোনো প্রকার রিফান্ড দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        4. ম্যাচ শুরু হওয়ার পরে যদি কোনো কারণে আপনি ম্যাচে প্রবেশ করতে না পারেন,
        তাহলে এর জন্য Rush Arena বা প্রতিপক্ষ টিম দায়ী থাকবে না, কারণ এটি আপনার
        নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-red-400 mt-3">
        5. ম্যাচ চলাকালীন কেউ যদি টিমিং করে বা ইচ্ছাকৃতভাবে প্রতিপক্ষকে জিতিয়ে
        দেয়, তাহলে তার এন্ট্রি ফি সহ অতিরিক্ত ৫০ টাকা জরিমানা করা হবে।
      </p>

      <p className="text-red-400 mt-3">
        6. ম্যাচ চলাকালীন সকল প্লেয়ারকে শেষ পর্যন্ত গেমে থাকতে হবে। ইচ্ছাকৃতভাবে
        ম্যাচ ছেড়ে দেওয়া বা ব্যাক দেওয়া হলে সেটি অবৈধ আচরণ হিসেবে গণ্য করা হবে
        এবং ম্যাচ থেকে ব্যাক করলে কোনো ধরনের প্রাইজ মানি বা রিফান্ড দেওয়া হবে
        না।
      </p>

      <p className="text-green-400 mt-3">
        7. এই মোডে যে প্লেয়ার ম্যাচে হারবে, সেই প্লেয়ারই রিওয়ার্ড পাবে।
      </p>

      <p className="text-green-400 mt-3">
        যে প্লেয়ার জিতবে, সে কোনো রিওয়ার্ড পাবে না।✅
      </p>

      <p className="text-yellow-400 mt-3">
        8. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅"ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    // 10 --- Free Match Rules -----
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎮RUSH ARENA || Free Match Rules:-
      </p>

      <p className="text-yellow-400 mt-3">
        1. ম্যাচে জয়েন করার সময় অবশ্যই আপনার গেম আইডি ভালোভাবে মিলিয়ে নেবেন। গেম
        আইডি ব্যতীত অন্য কিছু লিখে ম্যাচ জয়েন করলে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        2. আপনি যে আইডি দিয়ে খেলবেন, সেই আইডির লেভেল কমপক্ষে 40 হতে হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        এর কম হলে আপনাকে ম্যাচ খেলতে দেওয়া হবে না।
      </p>

      <p className="text-yellow-400 mt-3">
        3. ম্যাচ শুরুর নির্ধারিত সময়ের মধ্যেই আপনাকে ম্যাচে জয়েন করতে হবে। সময়
        পার হয়ে গেলে জয়েন করতে না পারলে তার দায় Rush Arena নেবে না, এবং আপনি ওই
        ফ্রি ম্যাচ টি খেলতে পারবেন না। কারণ আপনার জন্য যথাযথ সময় পর্যন্ত অপেক্ষা
        করা হয়েছে।
      </p>

      <p className="text-yellow-400 mt-3">
        4. আপনি ম্যাচে জয়েন করার পর যদি দেখেন ৪৮ স্লট পূর্ণ অথবা আপনাকে ম্যাচ
        থেকে কিক করে দেওয়া হয়েছে, তাহলে আপনি ওই ম্যাচটি খেলতে পারবেন না।😅 তার
        কারণ এটি ফ্রি ম্যাচ, রুম আইডি দেওয়ার সাথে সাথে ফুল হয়ে যায়।
      </p>

      <p className="text-yellow-400 mt-3">
        সেক্ষেত্রে আপনি পরের ম্যাচটিতে চেষ্টা করতে পারে, আশা করি আপনি সেটাতে
        খেলতে পারবেন।
      </p>

      <p className="text-yellow-400 mt-3">
        5. ম্যাচ শুরু হওয়ার পর কোনো কারণে যদি আপনাকে ম্যাচে প্রবেশ করানো না হয়,
        তাহলে এর জন্য Rush Arena বা প্রতিপক্ষ দায়ী থাকবে না, কারণ এই সমস্যা
        সাধারণত আপনার নেটওয়ার্ক সমস্যার কারণে হতে পারে।
      </p>

      <p className="text-red-400 mt-3">
        6. ⛔যদি হ্যাক ইউজ করার সময় ধরা পরে তাহলে "Rush Arena" থেকে ব্যান করে
        দেওয়া হবে। তাও চিরতরের জন্য ডিভাইস ব্যান্ড করা হবে।☠️
      </p>

      <p className="text-green-400 mt-3">7. গাড়ি ব্যবহার করা যাবে।</p>

      <p className="text-green-400 mt-3">টিমিং করা যাবে না।</p>

      <p className="text-green-400 mt-3">
        সব ধরনের বন্দুক (Gun) ব্যবহার করা যাবে।
      </p>

      <p className="text-green-400 mt-3">Oto Aim Off থাকবে।</p>

      <p className="text-green-400 mt-3">200 Hp থাকবে।</p>

      <p className="text-green-400 mt-3">
        revive off থাকবে। একবার মরে গেলে আর রিভাইভ পাবেন না।
      </p>

      <p className="text-green-400 mt-3">অবশ্যই আপনার টপ 10 ভিতর থাকতে হবে।</p>

      <p className="text-yellow-400 mt-3">
        8. ম্যাচ এর মধ্যে ভিন্ন ভিন্ন স্ক্রিনশট রাখতে হবে, এডমিন চাইলে দিতে হবে,
        এবং ম্যাচ শেষ হওয়ার পর একটি স্ক্রিনশট মারতে হবে, এবং সেটি সাপোর্ট দিতে
        হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        screenshot বা কোন প্রমাণ না দিতে পারলে আপনি রেওয়ার্ড পাবেন না।
      </p>

      <p className="text-yellow-400 mt-3">
        9. 💬যেকোনো সমস্যায় টেলিগ্রাম এডমিনের সাথে যোগাযোগ করুন।
      </p>

      <p className="text-green-400 mt-3">
        ✅"ADMIN" এর সিদ্ধান্তই চূড়ান্ত সিদ্ধান্ত।
      </p>
    </>,
    <>
      <p className="text-yellow-400 font-semibold text-lg mt-3">
        🎲 Rush ARena Match নিয়মাবলি:
      </p>

      <p className="text-blue-400 mt-3">
        📱 Rush ARena Match Support টেলিগ্রাম গ্রুপে জয়েন করতে হবে।
      </p>

      <p className="text-green-400 mt-3">
        🖼️ ম্যাচে Win হবার পরে Winning স্ক্রিনশট নিবেন। ম্যাচ খেলার সময় ১/২ টি
        স্ক্রিনশট নিবেন এবং ম্যাচ Start হবার সময় ১০/১৫ সেকেন্ড এর একটি
        স্ক্রিনরেকর্ড করতে হবে। এগুলো ম্যাচ শেষে ৫-১০ মিনিটের মধ্যে Caption সহ
        Rush Arena Match Support গ্রুপে সেন্ড করতে হবে।
      </p>

      <p className="text-red-400 mt-3">
        ✍️ গ্রুপে সেন্ড করার সময় Captipn এ SMS এ Match Time / Match No লিখে দিতে
        হবে, তা না হলে রিওয়ার্ড পাবেন না।
      </p>

      <p className="text-red-400 mt-3">
        ⚠️ Match তে কেউ কোনো প্রকার প্রতারণা করার চেষ্টা করলে অথবা Fake
        স্ক্রিনশট Edit করে গ্রুপে দিলে "Rush ARena" App থেকে Ban দেওয়া হবে।
      </p>

      <p className="text-yellow-400 mt-3">
        🧾 "Rush ARena" অ্যাপে যে নামে ম্যাচে জয়েন হয়েছেন, "Match King" অ্যাপে
        সে নামের সাথে মিল না থাকলে রিওয়ার্ড পাবেন না।
      </p>

      <p className="text-blue-400 mt-3">
        🔑 Room ID & Pass ম্যাচ টাইমের ৫-৬ মিনিট আগে Room Details এ দেওয়া হবে।
        সময় মত ম্যাচে জয়েন না করতে পারলে রিফান্ড পাবেন না।
      </p>

      <p className="text-green-400 mt-3">
        👤 আপনি ম্যাচে জয়েন করার পরে Opponent রুমে জয়েন না করলে আপনাকে ম্যাচের
        টাকা রিফান্ড করা হবে না।
      </p>
    </>,
  ];

  const MatchTypes = {
    [MatchType1]: contents[1],
    [MatchType2]: contents[2],
    [MatchType3]: contents[3],
    [MatchType4]: contents[4],
    [MatchType5]: contents[5],
    [MatchType6]: contents[6],
    [MatchType7]: contents[7],
    [MatchType8]: contents[8],
    [MatchType9]: contents[9],
    [MatchType10]: contents[10],
  };

  return (
    <div className=" bg-[#0a0a1a] text-white p-4">
      <h1 className="text-center text-2xl font-bold mb-4">All Rules</h1>

      {/* Tabs */}
      <div className="flex overflow-x-auto space-x-2 mt-4 mb-6 no-scrollbar"></div>

      {/* Content */}

      <div className="bg-gray-900 p-4 rounded-2xl shadow-lg text-sm leading-relaxed">
        {/* {contents[getMatchTypeNumber(matchType)-1]} */}
        {MatchTypes[matchType] || (
          <p className="text-center text-gray-500">
            No rules available for this match type.
          </p>
        )}
      </div>
    </div>
  );
}
